// ১ থেকে ৫০ এর মধ্যে কোন সংখ্যা যদি ৩ দিয়ে ভাগ যায় এবং ভাগশেষ ০ হয় তাহলে তার নাম সেট করতে হবে foo.
// ১ থেকে ৫০ এর মধ্যে কোন সংখ্যা যদি ৫ দিয়ে ভাগ যায় এবং ভাগশেষ ০ হয় তাহলে তার নাম সেট করতে হবে bar.
// ১ থেকে ৫০ এর মধ্যে কোন সংখ্যা যদি ৩ দিয়ে এবং ৫ দিয়ে ভাগ যায় এবং ভাগশেষ ০ হয় তাহলে তার নাম সেট করতে হবে foobar.

// [1-50] - i%3 and i%5 and i%3 & i%5 -names set
for(let i = 1; i <= 50; i++){
  if(i%3 == 0 && i%5 == 0){
    console.log('foobar');
  }
  else if(i%3 == 0){
    console.log('foo');
  }
  else if(i%5 == 0){
    console.log('bar');
  }
  else {
    console.log(i);
  }
}